htmlPerfectClientWrk2V2.txt
Running 5m test @ http://169.254.140.128:8181/htmlLargePerfect
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.999ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.626ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.83ms  739.21us   6.37ms   68.69%
    Req/Sec    59.58     98.06   333.00     74.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.76ms
 75.000%    3.28ms
 90.000%    3.83ms
 99.000%    4.82ms
 99.900%    5.68ms
 99.990%    6.26ms
 99.999%    6.37ms
100.000%    6.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.021     0.000000            1         1.00
       1.943     0.100000         2898         1.11
       2.197     0.200000         5796         1.25
       2.395     0.300000         8676         1.43
       2.575     0.400000        11582         1.67
       2.757     0.500000        14458         2.00
       2.849     0.550000        15899         2.22
       2.941     0.600000        17353         2.50
       3.047     0.650000        18810         2.86
       3.155     0.700000        20253         3.33
       3.277     0.750000        21680         4.00
       3.343     0.775000        22402         4.44
       3.419     0.800000        23140         5.00
       3.503     0.825000        23846         5.71
       3.605     0.850000        24574         6.67
       3.709     0.875000        25298         8.00
       3.769     0.887500        25659         8.89
       3.833     0.900000        26014        10.00
       3.907     0.912500        26373        11.43
       3.985     0.925000        26739        13.33
       4.073     0.937500        27097        16.00
       4.131     0.943750        27282        17.78
       4.191     0.950000        27457        20.00
       4.259     0.956250        27645        22.86
       4.319     0.962500        27819        26.67
       4.399     0.968750        28001        32.00
       4.443     0.971875        28093        35.56
       4.491     0.975000        28181        40.00
       4.543     0.978125        28270        45.71
       4.599     0.981250        28362        53.33
       4.667     0.984375        28451        64.00
       4.703     0.985938        28495        71.11
       4.747     0.987500        28539        80.00
       4.799     0.989062        28588        91.43
       4.831     0.990625        28630       106.67
       4.903     0.992188        28676       128.00
       4.943     0.992969        28699       142.22
       4.987     0.993750        28720       160.00
       5.019     0.994531        28743       182.86
       5.083     0.995313        28767       213.33
       5.155     0.996094        28788       256.00
       5.199     0.996484        28799       284.44
       5.247     0.996875        28811       320.00
       5.287     0.997266        28823       365.71
       5.367     0.997656        28833       426.67
       5.443     0.998047        28844       512.00
       5.487     0.998242        28851       568.89
       5.511     0.998437        28855       640.00
       5.583     0.998633        28861       731.43
       5.647     0.998828        28868       853.33
       5.687     0.999023        28873      1024.00
       5.711     0.999121        28875      1137.78
       5.743     0.999219        28878      1280.00
       5.799     0.999316        28881      1462.86
       5.839     0.999414        28884      1706.67
       5.895     0.999512        28886      2048.00
       5.923     0.999561        28888      2275.56
       5.995     0.999609        28889      2560.00
       6.111     0.999658        28891      2925.71
       6.119     0.999707        28892      3413.33
       6.199     0.999756        28894      4096.00
       6.199     0.999780        28894      4551.11
       6.211     0.999805        28895      5120.00
       6.247     0.999829        28896      5851.43
       6.247     0.999854        28896      6826.67
       6.255     0.999878        28897      8192.00
       6.255     0.999890        28897      9102.22
       6.291     0.999902        28898     10240.00
       6.291     0.999915        28898     11702.86
       6.291     0.999927        28898     13653.33
       6.307     0.999939        28899     16384.00
       6.307     0.999945        28899     18204.44
       6.307     0.999951        28899     20480.00
       6.307     0.999957        28899     23405.71
       6.307     0.999963        28899     27306.67
       6.371     0.999969        28900     32768.00
       6.371     1.000000        28900          inf
#[Mean    =        2.832, StdDeviation   =        0.739]
#[Max     =        6.368, Total count    =        28900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30002 requests in 5.00m, 42.60MB read
Requests/sec:    100.00
Transfer/sec:    145.42KB