jsonPerfectClientWrk2V2.txt
Running 5m test @ http://169.254.140.128:8080/jsonShortPerfect
  2 threads and 100 connections
  Thread calibration: mean lat.: 9.323ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 9.525ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.00ms    2.78ms  17.28ms   68.49%
    Req/Sec    53.28    287.61     2.00k    96.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.73ms
 75.000%    9.66ms
 90.000%   11.98ms
 99.000%   15.17ms
 99.900%   16.42ms
 99.990%   16.88ms
 99.999%   17.30ms
100.000%   17.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.705     0.000000            1         1.00
       4.643     0.100000         2890         1.11
       5.659     0.200000         5792         1.25
       6.419     0.300000         8671         1.43
       7.115     0.400000        11577         1.67
       7.727     0.500000        14460         2.00
       8.047     0.550000        15904         2.22
       8.367     0.600000        17344         2.50
       8.743     0.650000        18787         2.86
       9.167     0.700000        20236         3.33
       9.663     0.750000        21688         4.00
       9.959     0.775000        22419         4.44
      10.287     0.800000        23141         5.00
      10.639     0.825000        23857         5.71
      11.047     0.850000        24569         6.67
      11.487     0.875000        25290         8.00
      11.735     0.887500        25661         8.89
      11.975     0.900000        26016        10.00
      12.239     0.912500        26374        11.43
      12.503     0.925000        26735        13.33
      12.767     0.937500        27098        16.00
      12.919     0.943750        27280        17.78
      13.103     0.950000        27468        20.00
      13.255     0.956250        27643        22.86
      13.495     0.962500        27822        26.67
      13.759     0.968750        28000        32.00
      13.935     0.971875        28088        35.56
      14.103     0.975000        28178        40.00
      14.303     0.978125        28268        45.71
      14.511     0.981250        28359        53.33
      14.719     0.984375        28451        64.00
      14.839     0.985938        28496        71.11
      14.967     0.987500        28539        80.00
      15.095     0.989062        28584        91.43
      15.223     0.990625        28630       106.67
      15.423     0.992188        28675       128.00
      15.495     0.992969        28697       142.22
      15.575     0.993750        28720       160.00
      15.655     0.994531        28743       182.86
      15.759     0.995313        28765       213.33
      15.863     0.996094        28788       256.00
      15.903     0.996484        28800       284.44
      15.967     0.996875        28810       320.00
      16.039     0.997266        28821       365.71
      16.119     0.997656        28833       426.67
      16.231     0.998047        28845       512.00
      16.271     0.998242        28851       568.89
      16.303     0.998437        28857       640.00
      16.327     0.998633        28861       731.43
      16.359     0.998828        28867       853.33
      16.415     0.999023        28872      1024.00
      16.447     0.999121        28876      1137.78
      16.479     0.999219        28878      1280.00
      16.527     0.999316        28882      1462.86
      16.607     0.999414        28884      1706.67
      16.639     0.999512        28887      2048.00
      16.655     0.999561        28888      2275.56
      16.703     0.999609        28889      2560.00
      16.751     0.999658        28892      2925.71
      16.751     0.999707        28892      3413.33
      16.783     0.999756        28893      4096.00
      16.831     0.999780        28894      4551.11
      16.847     0.999805        28895      5120.00
      16.863     0.999829        28896      5851.43
      16.863     0.999854        28896      6826.67
      16.879     0.999878        28897      8192.00
      16.879     0.999890        28897      9102.22
      16.927     0.999902        28898     10240.00
      16.927     0.999915        28898     11702.86
      16.927     0.999927        28898     13653.33
      17.087     0.999939        28899     16384.00
      17.087     0.999945        28899     18204.44
      17.087     0.999951        28899     20480.00
      17.087     0.999957        28899     23405.71
      17.087     0.999963        28899     27306.67
      17.295     0.999969        28900     32768.00
      17.295     1.000000        28900          inf
#[Mean    =        8.003, StdDeviation   =        2.782]
#[Max     =       17.280, Total count    =        28900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29902 requests in 5.00m, 4.33MB read
Requests/sec:     99.67
Transfer/sec:     14.79KB